MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\Pin_Overflow.h
/*******************************************************************************
* File Name: Pin_Overflow.h  
* Version 1.50
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2010, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_PINS_Pin_Overflow_H) /* Pins Pin_Overflow_H */
#define CY_PINS_Pin_Overflow_H

#include "cytypes.h"
#include "cyfitter.h"
#include "cypins.h"
#include "Pin_Overflow_aliases.h"


/***************************************
*        Function Prototypes             
***************************************/    

void    Pin_Overflow_Write(uint8 value) ;
void    Pin_Overflow_SetDriveMode(uint8 mode) ;
uint8   Pin_Overflow_ReadDataReg(void) ;
uint8   Pin_Overflow_Read(void) ;
uint8   Pin_Overflow_ClearInterrupt(void) ;

/***************************************
*           API Constants        
***************************************/

/* Drive Modes */
#define Pin_Overflow_DM_ALG_HIZ         PIN_DM_ALG_HIZ
#define Pin_Overflow_DM_DIG_HIZ         PIN_DM_DIG_HIZ
#define Pin_Overflow_DM_RES_UP          PIN_DM_RES_UP
#define Pin_Overflow_DM_RES_DWN         PIN_DM_RES_DWN
#define Pin_Overflow_DM_OD_LO           PIN_DM_OD_LO
#define Pin_Overflow_DM_OD_HI           PIN_DM_OD_HI
#define Pin_Overflow_DM_STRONG          PIN_DM_STRONG
#define Pin_Overflow_DM_RES_UPDWN       PIN_DM_RES_UPDWN

/* Digital Port Constants */
#define Pin_Overflow_MASK               Pin_Overflow__MASK
#define Pin_Overflow_SHIFT              Pin_Overflow__SHIFT
#define Pin_Overflow_WIDTH              1u

/***************************************
*             Registers        
***************************************/

/* Main Port Registers */
/* Pin State */
#define Pin_Overflow_PS                     (* (reg8 *) Pin_Overflow__PS)
/* Data Register */
#define Pin_Overflow_DR                     (* (reg8 *) Pin_Overflow__DR)
/* Port Number */
#define Pin_Overflow_PRT_NUM                (* (reg8 *) Pin_Overflow__PRT) 
/* Connect to Analog Globals */                                                  
#define Pin_Overflow_AG                     (* (reg8 *) Pin_Overflow__AG)                       
/* Analog MUX bux enable */
#define Pin_Overflow_AMUX                   (* (reg8 *) Pin_Overflow__AMUX) 
/* Bidirectional Enable */                                                        
#define Pin_Overflow_BIE                    (* (reg8 *) Pin_Overflow__BIE)
/* Bit-mask for Aliased Register Access */
#define Pin_Overflow_BIT_MASK               (* (reg8 *) Pin_Overflow__BIT_MASK)
/* Bypass Enable */
#define Pin_Overflow_BYP                    (* (reg8 *) Pin_Overflow__BYP)
/* Port wide control signals */                                                   
#define Pin_Overflow_CTL                    (* (reg8 *) Pin_Overflow__CTL)
/* Drive Modes */
#define Pin_Overflow_DM0                    (* (reg8 *) Pin_Overflow__DM0) 
#define Pin_Overflow_DM1                    (* (reg8 *) Pin_Overflow__DM1)
#define Pin_Overflow_DM2                    (* (reg8 *) Pin_Overflow__DM2) 
/* Input Buffer Disable Override */
#define Pin_Overflow_INP_DIS                (* (reg8 *) Pin_Overflow__INP_DIS)
/* LCD Common or Segment Drive */
#define Pin_Overflow_LCD_COM_SEG            (* (reg8 *) Pin_Overflow__LCD_COM_SEG)
/* Enable Segment LCD */
#define Pin_Overflow_LCD_EN                 (* (reg8 *) Pin_Overflow__LCD_EN)
/* Slew Rate Control */
#define Pin_Overflow_SLW                    (* (reg8 *) Pin_Overflow__SLW)

/* DSI Port Registers */
/* Global DSI Select Register */
#define Pin_Overflow_PRTDSI__CAPS_SEL       (* (reg8 *) Pin_Overflow__PRTDSI__CAPS_SEL) 
/* Double Sync Enable */
#define Pin_Overflow_PRTDSI__DBL_SYNC_IN    (* (reg8 *) Pin_Overflow__PRTDSI__DBL_SYNC_IN) 
/* Output Enable Select Drive Strength */
#define Pin_Overflow_PRTDSI__OE_SEL0        (* (reg8 *) Pin_Overflow__PRTDSI__OE_SEL0) 
#define Pin_Overflow_PRTDSI__OE_SEL1        (* (reg8 *) Pin_Overflow__PRTDSI__OE_SEL1) 
/* Port Pin Output Select Registers */
#define Pin_Overflow_PRTDSI__OUT_SEL0       (* (reg8 *) Pin_Overflow__PRTDSI__OUT_SEL0) 
#define Pin_Overflow_PRTDSI__OUT_SEL1       (* (reg8 *) Pin_Overflow__PRTDSI__OUT_SEL1) 
/* Sync Output Enable Registers */
#define Pin_Overflow_PRTDSI__SYNC_OUT       (* (reg8 *) Pin_Overflow__PRTDSI__SYNC_OUT) 


#if defined(Pin_Overflow__INTSTAT)  /* Interrupt Registers */

    #define Pin_Overflow_INTSTAT                (* (reg8 *) Pin_Overflow__INTSTAT)
    #define Pin_Overflow_SNAP                   (* (reg8 *) Pin_Overflow__SNAP)

#endif /* Interrupt Registers */

#endif /* End Pins Pin_Overflow_H */


/* [] END OF FILE */
